src/test/resources/esindus_v2_isikuga.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xro="http://x-road.eu/xsd/xroad.xsd"
                  xmlns:iden="http://x-road.eu/xsd/identifiers" xmlns:prod="http://arireg.x-road.eu/producer/">
    <soapenv:Header>
        <xro:protocolVersion>4.0</xro:protocolVersion>
        <xro:userId>EE11111111111</xro:userId>
        <xro:id>111111111111111123</xro:id>
        <xro:service iden:objectType="SERVICE">
            <iden:xRoadInstance>ee-test</iden:xRoadInstance>
            <iden:memberClass>GOV</iden:memberClass>
            <iden:memberCode>70000310</iden:memberCode>
            <iden:subsystemCode>arireg</iden:subsystemCode>
            <iden:serviceCode>esindus_v2</iden:serviceCode>
            <iden:serviceVersion>v1</iden:serviceVersion>
        </xro:service>
        <xro:client iden:objectType="SUBSYSTEM">
            <iden:xRoadInstance>ee-test</iden:xRoadInstance>
            <iden:memberClass>GOV</iden:memberClass>
            <iden:memberCode>70006317</iden:memberCode>
            <iden:subsystemCode>idp</iden:subsystemCode>
        </xro:client>
    </soapenv:Header>
    <soapenv:Body>
        <prod:esindus_v2>
            <prod:keha>
                <prod:fyysilise_isiku_kood>37012082723</prod:fyysilise_isiku_kood>
                <prod:fyysilise_isiku_koodi_riik>EST</prod:fyysilise_isiku_koodi_riik>
            </prod:keha>
            prod:keha>
        </prod:esindus_v2>
    </soapenv:Body>
</soapenv:Envelope>